
<table>
<tr>
<td width=15%><img src="./img/UGA.png"></img></td>
<td><center><h1>Python Tutorial</h1></center></td>
<td width=15%><a href="http://www.iutzeler.org" style="font-size: 16px; font-weight: bold">Franck Iutzeler</a><br/> Fall. 2018 </td>
</tr>
</table>

<br/><br/><div id="top"></div>

<center><a style="font-size: 40pt; font-weight: bold">Data Handling with Pandas </a></center>

<br/>

# ``1. Pandas formats``

---

<a href="#style"><b>Package check and Styling</b></a><br/><br/><b>Outline</b><br/><br/>
&nbsp;&nbsp;&nbsp; a) <a href="#introSer"> Pandas Series</a><br/>&nbsp;&nbsp;&nbsp; b) <a href="#introData"> Pandas DataFrames</a><br/>&nbsp;&nbsp;&nbsp; c) <a href="#introIndex"> Indexing</a><br/>


Let us take a look at the data structures provided by the **Pandas** library.

Pandas is a newer package built on top of NumPy which provides an efficient implementation of **DataFrames**. DataFrames are essentially multidimensional arrays with attached row and column labels, and often with heterogeneous types and/or missing data. As well as offering a convenient storage interface for labeled data, Pandas implements a number of powerful data operations. The DataFrame type and processing comes from the **R** language, familiar to statisticians. Conveniently, Pandas DataFrames benefit from fancy printing in Jupyter notebooks.

Just as we generally import NumPy under the alias ``np``, we will import Pandas under the alias ``pd``.

In [3]:
import pandas as pd
import numpy as np

## <a id="introSer"> a) Pandas Series</a>  <p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>


A Pandas ``Series`` is a one-dimensional array of indexed data.

In [4]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

The contents can be accessed in the same way as for NumPy arrays, to the difference that when more than one value is selected, the type remains a Pandas ``Series``.

In [5]:
print(data[0],type(data[0]))

(0.25, <type 'numpy.float64'>)

In [6]:
print(data[2:],type(data[2:]))

(2    0.75
3    1.00
dtype: float64, <class 'pandas.core.series.Series'>)

The type ``Series`` wraps both a sequence of values and a sequence of indices, which we can access with the <tt>values</tt> and <tt>index</tt> attributes.

* ``values`` are the contents of the series as a NumPy array

In [7]:
print(data.values,type(data.values))

(array([ 0.25,  0.5 ,  0.75,  1.  ]), <type 'numpy.ndarray'>)

* ``index`` are the indices of the series

In [8]:
print(data.index,type(data.index))

(RangeIndex(start=0, stop=4, step=1), <class 'pandas.core.indexes.range.RangeIndex'>)

### Series Indices

The main difference between NumPy arrays and Pandas Series is the presence of this <tt>index</tt> field. By default, it is set (as in NumPy arrays) as <tt>0,1,..,size_of_the_series</tt> but a Series index can be explicitly defined. The indices may be numbers but also strings. Then, the contents of the series *have to* be accessed using these defined indices.

In [12]:
named_data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
print(named_data)

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
print(named_data['c'])

0.75

*Warning:* Things can get strange...

In [16]:
print(named_data[0])

0.25

and even stranger...

In [9]:
data_S = pd.Series([0.25, 0.5, 0.75, 1.0], index=[1, 3, 4, 2])
print(data_S)

1    0.25
3    0.50
4    0.75
2    1.00
dtype: float64

In [10]:
print(data_S[2])

1.0

### Series and Python Dictionaries [\*] 

Pandas Series and Python Dictionaries are close semantically: mappping keys to values. However, the implementation of Pandas series is usually more efficient than dictionaries in the context of data science. Naturally, Series can be contructed from dictionaries.

In [17]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
print(population_dict,type(population_dict))
print(population,type(population))

({'Florida': 19552860, 'New York': 19651127, 'California': 38332521, 'Texas': 26448193, 'Illinois': 12882135}, <type 'dict'>)
(California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64, <class 'pandas.core.series.Series'>)

In [18]:
population['California']

38332521

In [19]:
population['California':'Illinois']

California    38332521
Florida       19552860
Illinois      12882135
dtype: int64

## <a id="introData"> b) Pandas DataFrames</a>
<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

DataFrames is *the* fundamental object of Pandas. 


Dataframes can be seen as an array of Series: to each <tt>index</tt> (corresponding to an individual for instance or a line in a table), a Dataframe maps multiples values; these values corresponds to the <tt>columns</tt> of the DataFrame which each have a name (as a string).   


In the following example, we will construct a Dataframe from two Series with common indices.

In [20]:
area = pd.Series( {'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995})
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127, 'Florida': 19552860, 'Illinois': 12882135})

In [21]:
states = pd.DataFrame({'Population': population, 'Area': area})
print(states,type(states))

(              Area  Population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193, <class 'pandas.core.frame.DataFrame'>)

In Jupyter notebooks, DataFrames are displayed in a fancier way when the name of the dataframe is typed (instead of using <tt>print</tt>)

In [22]:
states

              Area  Population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

DataFrames have 
* <tt>index</tt> that are the defined indices as in Series
* <tt>columns</tt> that are the columns names
* <tt>values</tt> that return a (2D) NumPy array with the contents

In [23]:
print(states.index)
print(states.columns)
print(states.values,type(states.values),states.values.shape)

Index([u'California', u'Florida', u'Illinois', u'New York', u'Texas'], dtype='object')
Index([u'Area', u'Population'], dtype='object')
(array([[  423967, 38332521],
       [  170312, 19552860],
       [  149995, 12882135],
       [  141297, 19651127],
       [  695662, 26448193]]), <type 'numpy.ndarray'>, (5, 2))

<div class="warn"> **Warning:**  When accessing a Dataframe, <tt>dataframe_name[column_name]</tt> return the corresponding column as a Series. <tt>dataframe_name[index_name]</tt> returns an error! We will see later how to access a specific index. </div>

In [24]:
print(states['Area'],type(states['Area']))

(California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: Area, dtype: int64, <class 'pandas.core.series.Series'>)

In [25]:
print(states['California'])

KeyError: 'California'

### Dataframe creation

To create DataFrames, the main methods are:
* from Series (as above)

In [26]:
print(population,type(population))
states = pd.DataFrame({'Population': population, 'Area': area})
states

(California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64, <class 'pandas.core.series.Series'>)

              Area  Population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

* from NumPy arrays (the columns and indices are taken as the array's ones)

In [27]:
A = np.random.randn(5,3)
print(A,type(A))
dfA = pd.DataFrame(A)
dfA

(array([[-0.05797556,  2.03147674,  1.14073212],
       [ 0.75050288,  0.97700821,  0.26424693],
       [ 0.50517307, -0.05322607, -0.88547911],
       [-0.76274472,  0.41487294, -0.24920737],
       [-1.34295928, -0.4840525 , -0.92062588]]), <type 'numpy.ndarray'>)

          0         1         2
0 -0.057976  2.031477  1.140732
1  0.750503  0.977008  0.264247
2  0.505173 -0.053226 -0.885479
3 -0.762745  0.414873 -0.249207
4 -1.342959 -0.484053 -0.920626

* from a *list* of *dictionaries*. Be careful, each element of the list is an example (corresponding to an automatic index 0,1,...) while each key of the dictonary corresponds to a column.

In [31]:
data = [{'a': i, 'b': 2 * i} for i in range(3)]
print(data,type(data))

([{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}], <type 'list'>)

In [32]:
df = pd.DataFrame(data)
df

   a  b
0  0  0
1  1  2
2  2  4

* from a *file* , typically a <tt>csv</tt> file (for comma separated values), eventually with the names of the columns as a first line.


    col_1_name,col_2_name,col_3_name
    col_1_v1,col_2_v1,col_3_v1
    col_1_v2,col_2_v2,col_3_v2
    ...
    
For other files types (MS Excel, libSVM, any other separator) see this [part of the doc](https://pandas.pydata.org/pandas-docs/stable/api.html#input-output)

In [34]:
!head -4 data/president_heights.csv # Jupyter bash command to see the first 4 lines of the file

order,name,height(cm)
1,George Washington,189
2,John Adams,170
3,Thomas Jefferson,189

In [35]:
data = pd.read_csv('data/president_heights.csv')
data

    order                    name  height(cm)
0       1       George Washington         189
1       2              John Adams         170
2       3        Thomas Jefferson         189
3       4           James Madison         163
4       5            James Monroe         183
5       6       John Quincy Adams         171
6       7          Andrew Jackson         185
7       8        Martin Van Buren         168
8       9  William Henry Harrison         173
9      10              John Tyler         183
10     11           James K. Polk         173
11     12          Zachary Taylor         173
12     13        Millard Fillmore         175
13     14         Franklin Pierce         178
14     15          James Buchanan         183
15     16         Abraham Lincoln         193
16     17          Andrew Johnson         178
17     18        Ulysses S. Grant         173
18     19     Rutherford B. Hayes         174
19     20       James A. Garfield         183
20     21       Chester A. Arthur         183
21     23       Benjamin Harrison         168
22     25        William McKinley         170
23     26      Theodore Roosevelt         178
24     27     William Howard Taft         182
25     28          Woodrow Wilson         180
26     29       Warren G. Harding         183
27     30         Calvin Coolidge         178
28     31          Herbert Hoover         182
29     32   Franklin D. Roosevelt         188
30     33         Harry S. Truman         175
31     34    Dwight D. Eisenhower         179
32     35         John F. Kennedy         183
33     36       Lyndon B. Johnson         193
34     37           Richard Nixon         182
35     38             Gerald Ford         183
36     39            Jimmy Carter         177
37     40           Ronald Reagan         185
38     41       George H. W. Bush         188
39     42            Bill Clinton         188
40     43          George W. Bush         182
41     44            Barack Obama         185
42     45            Donald Trump         188

### Names and Values

Notice there can be missing values in DataFrames.

In [36]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

You can set indices and columns names *a posteriori*

In [37]:
dfA.columns = ['a','b','c']
dfA.index = [i**2 for i in range(1,6)  ]
dfA

           a         b         c
1  -0.057976  2.031477  1.140732
4   0.750503  0.977008  0.264247
9   0.505173 -0.053226 -0.885479
16 -0.762745  0.414873 -0.249207
25 -1.342959 -0.484053 -0.920626

Actually, the type of the columns and index fields are Pandas Index type that gives some extra methods

In [38]:
type(dfA.index)

pandas.core.indexes.numeric.Int64Index

In [40]:
dfA.index.is_monotonic_increasing

True

In [41]:
dfA.index.inferred_type

'integer'

In [43]:
dfA.columns.inferred_type

'string'

In [45]:
dfA.columns.is_unique

True

## <a id="introIndex"> c) Indexing</a> 
<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

In [46]:
area = pd.Series( {'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995})
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127, 'Florida': 19552860, 'Illinois': 12882135})
states = pd.DataFrame({'Population': population, 'Area': area})
states

              Area  Population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

You may access columns directly with names, *then* you can access individuals with their index (as their are series).

In [49]:
states['Area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: Area, dtype: int64

In [50]:
states['Area']['Texas']

695662

To ease the access, Pandas offers dedicated methods:
* <tt>iloc</tt> enables to access subparts of the dataframe as if it was a NumPy array.

In [51]:
states.iloc[:2]

              Area  Population
California  423967    38332521
Florida     170312    19552860

In [52]:
states.iloc[:2,0]

California    423967
Florida       170312
Name: Area, dtype: int64

* <tt>loc</tt> does the same but with the explicit names (the last one is included)

In [57]:
states.loc[['California','Florida']]

              Area  Population
California  423967    38332521
Florida     170312    19552860

In [58]:
states.loc[:'New York']

              Area  Population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127

In [59]:
states.loc[:,'Population':]

            Population
California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193

<br/><br/>


# ``2.  Operations on Dataframes``

---

<a href="#style"><b>Package check and Styling</b></a><br/><br/><b>Outline</b><br/><br/>
&nbsp;&nbsp;&nbsp; a) <a href="#dataOp"> Operations</a><br/>&nbsp;&nbsp;&nbsp; b) <a href="#dataApp"> Appending, Concatenating, and Merging</a><br/>&nbsp;&nbsp;&nbsp; c) <a href="#dataPre"> Preparing the Data</a><br/>&nbsp;&nbsp;&nbsp; d) <a href="#dataBase"> Basic Statistics </a><br/>&nbsp;&nbsp;&nbsp; e) <a href="#dataGroup"> GroupBy <br/>

## <a id="dataOp"> a) Operations</a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

In [60]:
import numpy as np
import pandas as pd

### Numpy operations


If we apply a NumPy function on a Pandas datframe, the result will be another Pandas dataframe with the indices preserved.

In [61]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  2  7  6  0
1  8  1  6  1
2  7  2  3  9

In [62]:
np.cos(df * np.pi/2 ) - 1

     A    B    C    D
0 -2.0 -1.0 -2.0  0.0
1  0.0 -1.0 -2.0 -1.0
2 -1.0 -2.0 -1.0 -1.0

### Arithmetic operations

Arithmetic operations can also be performed either with <tt>+ - / *</tt> or with dedicated <tt>add multiply</tt> etc methods

In [63]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
A

    A   B
0   2   6
1  10  11

In [64]:
B = pd.DataFrame(np.random.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  9  5  1
1  2  4  2
2  9  8  0

In [65]:
A+B

      A     B   C
0   7.0  15.0 NaN
1  14.0  13.0 NaN
2   NaN   NaN NaN

The pandas arithmetic functions also have an option to fill missing values by replacing the missing one in either of the dataframes by some value.

In [66]:
A.add(B, fill_value=0.0)

      A     B    C
0   7.0  15.0  1.0
1  14.0  13.0  2.0
2   8.0   9.0  0.0

## <a id="dataApp"> b) Appending, Concatenating, and Merging</a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>


Thanks to naming, dataframes can be easily added, merged, etc. However, if some entries are missing (columns or indices), the operations may get complicated. Here the most standard situations are covered, take a look at the documentation (notably [this one on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html) )

* **Appending** is for adding the lines of one dataframe with another one with the same columns.

In [68]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
A2 = pd.DataFrame(np.random.randint(0, 20, (3, 2)), columns=list('AB'))

In [69]:
A

    A   B
0  14   8
1   3  12

In [70]:
A2

    A   B
0  16  14
1   2  13
2   6  19

In [71]:
A.append(A2) # this does not "append to A" but creates a new dataframe

    A   B
0  14   8
1   3  12
0  16  14
1   2  13
2   6  19

Sometimes, indexes do not matter, they can be resetted using <tt>ignore_index=True</tt>.

In [56]:
A.append(A2,ignore_index=True)

    A   B
0  10   2
1  12  12
2   3   4
3  15   3
4   2   1

This can still be done afterwards

In [73]:
AA = A.append(A2)

In [75]:
AA.index.is_unique

False

In [77]:
AA.reset_index(drop=True,inplace=True)

In [78]:
AA.index.is_unique

True

In [79]:
AA

    A   B
0  14   8
1   3  12
2  16  14
3   2  13
4   6  19

* **Concatenating** is for adding lines and/or columns of multiples datasets (it is a generalization of appending)

In [80]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
A2 = pd.DataFrame(np.random.randint(0, 20, (3, 2)), columns=list('AB'))
A3 = pd.DataFrame(np.random.randint(0, 20, (1, 3)), columns=list('CAD'))

In [81]:
A

    A   B
0   7  12
1  12   4

In [82]:
A2

    A   B
0  18  12
1   7   8
2  14  14

In [83]:
A3

   C   A   D
0  5  10  10

The most important settings of the <tt>concat</tt> function are <tt>pd.concat(objs, axis=0, join='outer',ignore_index=False)</tt> where <br/>
. *objs* is the list of dataframes to concatenate <br/>
. *axis* is the axis on which to concatenate 0 (default) for the lines and 1 for the columns <br/>
. *join* is to decide if we keep all columns/indices on the other axis ('outer' ,default), or the intersection ( 'inner') <br/>
. *ignore_index* is to decide is we keep the previous names (False, default) or give new ones (True)


For a detailed view see  [this doc on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html)

In [84]:
pd.concat([A,A2,A3],ignore_index=True)

    A     B    C     D
0   7  12.0  NaN   NaN
1  12   4.0  NaN   NaN
2  18  12.0  NaN   NaN
3   7   8.0  NaN   NaN
4  14  14.0  NaN   NaN
5  10   NaN  5.0  10.0

In [85]:
pd.concat([A,A2,A3],axis=1)

      A     B   A   B    C     A     D
0   7.0  12.0  18  12  5.0  10.0  10.0
1  12.0   4.0   7   8  NaN   NaN   NaN
2   NaN   NaN  14  14  NaN   NaN   NaN

In [86]:
pd.concat([A,A2,A3],axis=1,ignore_index=True,join='inner')

   0   1   2   3  4   5   6
0  7  12  18  12  5  10  10

* **Merging** is for putting together two dataframes with *hopefully* common data


For a detailed view see  [this doc on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html)

In [87]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [88]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [89]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [90]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [91]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

## <a id="dataPre"> c) Preparing the Data</a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>


Before exploring the data, it is primordial to verify its soundness, indeed if it has missing or replicated data, the results of our test may not be accurate. Pandas provides a collection of methodes to verify the sanity of the data (recall that when data is missing for an entry, it is noted as <tt>NaN</tt>, and thus any further operation including this will be <tt>NaN</tt>). 


To explore some typical problems in a dataset, I messed with a small part of the [*MovieLens*](https://grouplens.org/datasets/movielens/) dataset. The <tt>ratings_mess.csv</tt> file contains 4 columns:
* <tt>userId</tt> id of the user, integer greater than 1 
* <tt>movieId</tt>  id of the user, integer greater than 1 
* <tt>rating</tt> rating of the user to the movie, float between 0.0 and 5.0  
* <tt>timestamp</tt> timestamp, integer 

and features (man-made!) errors, some of them minor some of them major.

In [92]:
ratings = pd.read_csv('data/ml-small/ratings_mess.csv')
ratings.head(7) # enables to display the top n lines of a dataframe, 5 by default

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0           NaN
3     2.0     52.0    83.0  8.353560e+08
4     NaN     62.0     3.0  8.353557e+08
5     2.0    144.0     NaN  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08

### Missing values


Pandas provides functions that check if the values are missing:

* ``isnull()``: Generate a boolean mask indicating missing values
* ``notnull()``: Opposite of ``isnull()``

In [93]:
ratings.isnull().head(5)

   userId  movieId  rating  timestamp
0   False    False   False      False
1   False    False   False      False
2   False    False   False       True
3   False    False   False      False
4    True    False   False      False

#### Carefully pruning data

Now that we have to prune lines of our data, this will be done using ``dropna()`` through <tt>dataframe.dropna(subset=["col_1","col_2"],inplace=True)</tt> which drops all rows with at least one missing value in the columns <tt>col1, col2</tt> of <tt>dataframe</tt> *in place* that is without copy.


<div class="warn"> <b>Warning:</b> this function deletes any line with at least **one** missing data, which is not always wishable. Also, with *inplace=True*, it is applied in place, meaning that they modify the dataframe it is applied to, it is thus an **irreversible operation**; drop *inplace=True* to create a copy or see the result before apllying it.</div>

For instance here, <tt>userId,movieId,rating</tt> are essential whereas the <tt>timestamp</tt> is not (it can be dropped for the prediciton process). Thus, we will delete the lines where one of <tt>userId,movieId,rating</tt> is missing and fill the <tt>timestamp</tt> with 0 when it is missing.

In [94]:
ratings.dropna(subset=["userId","movieId","rating"],inplace=True)
ratings.head(5)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0           NaN
3     2.0     52.0    83.0  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08

To fill missing data (from a certain column), the recommended way is to use ``fillna()`` through <tt>dataframe["col"].fillna(value,inplace=True)</tt> which replace all missing values in the column <tt>col</tt> of <tt>dataframe</tt> by <tt>value</tt> *in place* that is without copy (again this is irreversible, to use the copy version use inplace=False).

In [95]:
ratings["timestamp"].fillna(0,inplace=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08
8     2.0    720.0     4.0  8.353560e+08
9     3.0     60.0     3.0  1.298862e+09

This indeed gives the correct result, however, the line indexing presents missing number. The indexes can be resetted with  <tt>reset_index(inplace=True,drop=True)</tt>

In [96]:
ratings.reset_index(inplace=True,drop=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
4     0.0    616.0     3.0  8.353559e+08
5     2.0    720.0     4.0  8.353560e+08
6     3.0     60.0     3.0  1.298862e+09

### Improper values

Even without the missing values, some lines are problematic as they feature values outside of prescribed range (<tt>userId</tt> id of the user, integer greater than 1; <tt>movieId</tt>  id of the user, integer greater than 1; <tt>rating</tt> rating of the user to the movie, float between 0.0 and 5.0; <tt>timestamp</tt> timestamp, integer )

In [97]:
ratings[ratings["userId"]<1]  # Identifying a problem

   userId  movieId  rating    timestamp
4     0.0    616.0     3.0  835355932.0

Now, we drop the corresponding line, with ``drop`` by <tt>drop(problematic_row.index, inplace=True)</tt>. 

<div class="warn"> **Warning:** Do not forget <tt>.index</tt> and <tt>inplace=True</tt></div>

In [98]:
ratings.drop(ratings[ratings["userId"]<1].index, inplace=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
5     2.0    720.0     4.0  8.353560e+08
6     3.0     60.0     3.0  1.298862e+09
7     3.0    110.0     4.0  1.298922e+09

In [99]:
pb_rows = ratings[ratings["movieId"]<1]
pb_rows

    userId  movieId  rating     timestamp
12     3.0      0.0     3.0  1.298924e+09
24     4.0     -1.0     2.0  9.499822e+08

In [100]:
ratings.drop(pb_rows.index, inplace=True)

And finally the ratings.

In [101]:
pb_rows = ratings[ratings["rating"]<0]
pb_rows2 = ratings[ratings["rating"]>5]
tot_pb_rows = pb_rows.append(pb_rows2 )
tot_pb_rows

    userId  movieId  rating     timestamp
15     3.0   2858.0    -4.0  1.298922e+09
3      2.0     52.0    83.0  8.353560e+08
25     5.0   3176.0   123.5  1.163374e+09
29     6.0    111.0     6.0  1.109258e+09

In [102]:
ratings.drop(tot_pb_rows.index, inplace=True)
ratings.reset_index(inplace=True,drop=True)

We finally have our dataset cured! Let us save it for further use.

<tt>to_csv</tt> saves as CSV into some file, <tt>index=False</tt> drops the index names as we did not specify it.

In [103]:
ratings.to_csv("data/ml-small/ratings_cured.csv",index=False)

## <a id="dataBase"> d) Basic Statistics </a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

With our cured dataset, we can begin exploring.

In [104]:
ratings = pd.read_csv('data/ml-small/ratings_cured.csv')
ratings.head()

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0    720.0     4.0  8.353560e+08
4     3.0     60.0     3.0  1.298862e+09

The following table summarizes some other built-in Pandas aggregations:

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

These are all methods of ``DataFrame`` and ``Series`` objects, and ``description`` also provides a quick overview.

In [105]:
ratings.describe()

          userId       movieId     rating     timestamp
count  24.000000     24.000000  24.000000  2.400000e+01
mean    3.416667   2465.916667   4.020833  1.056019e+09
std     1.212854   6171.507686   0.926414  3.610777e+08
min     1.000000     10.000000   2.000000  0.000000e+00
25%     3.000000    213.250000   3.375000  9.498962e+08
50%     3.000000   1028.500000   4.000000  1.163375e+09
75%     4.000000   1628.000000   5.000000  1.298862e+09
max     6.000000  30749.000000   5.000000  1.298923e+09

We see that these statistics do not make sense for all rows. Let us drop the timestamp and examine the ratings.

In [106]:
ratings.drop("timestamp",axis=1,inplace=True)
ratings.head()

   userId  movieId  rating
0     1.0     31.0     2.5
1     1.0   1029.0     3.0
2     2.0     10.0     4.0
3     2.0    720.0     4.0
4     3.0     60.0     3.0

In [107]:
ratings["rating"].describe()

count    24.000000
mean      4.020833
std       0.926414
min       2.000000
25%       3.375000
50%       4.000000
75%       5.000000
max       5.000000
Name: rating, dtype: float64

## <a id="dataGroup"> e) GroupBy </a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

These ratings are linked to users and movies, in order to have a separate view per user/movie, *grouping* has to be used.

The ``GroupBy`` operation (that comes from SQL) accomplishes:

- The *split* step involves breaking up and grouping a ``DataFrame`` depending on the value of the specified key.
- The *apply* step involves computing some function, usually an sum, median, means etc *within the individual groups*.
- The *combine* step merges the results of these operations into an output array.

<img src="img/GroupBy.png">
<p style="text-align: right">Source: [Python Data Science Handbook](http://shop.oreilly.com/product/0636920034919.do) by Jake VanderPlas</p>

In [108]:
ratings.head()

   userId  movieId  rating
0     1.0     31.0     2.5
1     1.0   1029.0     3.0
2     2.0     10.0     4.0
3     2.0    720.0     4.0
4     3.0     60.0     3.0

So to get the mean of the ratings per user, the command is

In [109]:
ratings.groupby("userId")["rating"].mean()

userId
1.0    2.750000
2.0    4.000000
3.0    3.444444
4.0    5.000000
5.0    4.166667
6.0    4.500000
Name: rating, dtype: float64

### Filtering

Filtering is the action of deleting rows depending on a boolean function. For instance, the following removes the user with a rating of only one movie.

In [110]:
ratings.groupby("userId")["rating"].count()

userId
1.0    2
2.0    2
3.0    9
4.0    7
5.0    3
6.0    1
Name: rating, dtype: int64

In [111]:
def filter_func(x):
    return x["rating"].count() >= 2

filtered = ratings.groupby("userId").filter(filter_func)
filtered

    userId  movieId  rating
0      1.0     31.0     2.5
1      1.0   1029.0     3.0
2      2.0     10.0     4.0
3      2.0    720.0     4.0
4      3.0     60.0     3.0
5      3.0    110.0     4.0
6      3.0    247.0     3.5
7      3.0    592.0     3.0
8      3.0    593.0     3.0
9      3.0    595.0     2.0
10     3.0   2762.0     3.5
11     3.0   2841.0     4.0
12     3.0   2959.0     5.0
13     4.0     34.0     5.0
14     4.0    112.0     5.0
15     4.0   1028.0     5.0
16     4.0   1030.0     5.0
17     4.0   1079.0     5.0
18     4.0   1089.0     5.0
19     4.0   1097.0     5.0
20     5.0   4447.0     4.5
21     5.0   4718.0     3.5
22     5.0  30749.0     4.5

In [112]:
filtered.groupby("userId")["rating"].count()

userId
1.0    2
2.0    2
3.0    9
4.0    7
5.0    3
Name: rating, dtype: int64

### Transformations

Transforming is the actions of applying a transformation (sic).

For instance, let us normalize the ratings so that they have zero mean for each user.

In [113]:
ratings.groupby("userId")["rating"].mean()

userId
1.0    2.750000
2.0    4.000000
3.0    3.444444
4.0    5.000000
5.0    4.166667
6.0    4.500000
Name: rating, dtype: float64

In [114]:
def center_ratings(x):
    x["rating"] = x["rating"] - x["rating"].mean()
    return x

centered = ratings.groupby("userId").apply(center_ratings)

In [115]:
centered.groupby("userId")["rating"].mean()

userId
1.0    0.000000e+00
2.0    0.000000e+00
3.0   -1.973730e-16
4.0    0.000000e+00
5.0   -2.960595e-16
6.0    0.000000e+00
Name: rating, dtype: float64

#### Another method using lambda calculus [*]

In [116]:
centered = pd.DataFrame(ratings)
centered["rating"] = centered.groupby("userId")["rating"].transform(lambda x:x-x.mean())

### Aggregations [*]

Aggregations let you aggreagate several operations.

In [117]:
ratings.groupby("userId")["rating"].aggregate([min,max,np.mean,np.median,len])

             min       max          mean    median  len
userId
1.0    -0.250000  0.250000  0.000000e+00  0.000000  2.0
2.0     0.000000  0.000000  0.000000e+00  0.000000  2.0
3.0    -1.444444  1.555556 -1.973730e-16  0.055556  9.0
4.0     0.000000  0.000000  0.000000e+00  0.000000  7.0
5.0    -0.666667  0.333333 -2.960595e-16  0.333333  3.0
6.0     0.000000  0.000000  0.000000e+00  0.000000  1.0

<br/><br/>


# ``3.  Pandas in Practice``

---

Pandas enables concise and powerful data manipulation and is well integrated in the Data Science environment but beware of some caveats.

<img width="50%" src="./img/new_prog.jpg"></img>

<b>Outline</b><br/><br/>
&nbsp;&nbsp;&nbsp; a) <a href="#praMis">  Common problems</a><br/>
&nbsp;&nbsp;&nbsp; b) <a href="#praSK">  Machine Learning with Scikit Learn and Pandas </a>

## <a id="praMis"> a) Common Problems </a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

## <a id="praSK"> b) Machine Learning with Scikit Learn and Pandas </a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

<br/><br/>


# ``4.  Exercises``

---

<div class="exo"> **Exercise 3.2.1:** Bots Discovery<br/><br/>


In the dataset <tt>ratings_bots.csv</tt>, some users may be bots. To help a movie sucess they add ratings (faborable ones often). To get a better recommendation, we try to remove them by

<ul>
<li> Deleting all users with a mean rating above 4.7/5 (nobody is that nice) and count them. <br/>
* **hint:** the [nunique](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.nunique.html)  function may be helpful to count*</li>
<li> Deteting multiples reviews of movie by a single user by replacing them with only the first one. As it is a strange behavior, add a column "potential_bot" with a boolean flag True for them and False for the other. What is the proportion of potential bots amongst the users? <br/> 
* **hint:** the <tt>groupby</tt> function can be applied to several columns, also <tt>reset_index(drop=True)</tt> removes the grouby indexing.* <br/> 
* **hint:** remember the <tt>loc</tt> function, e.g.  <tt>df.loc[df['userId'] == 128]</tt> returns a dataframe of the rows where the userId is 128; and <tt>df.loc[df['userId'] == 128].loc[samerev['movieId'] == 3825]</tt> returns a dataframe of the rows where the userId is 128 **and** the movieID is 3825.* <br/> 
* **hint:** 17 ratings have to be removed, for instance, user 128 has 3 ratings of the movie 3825.*</li>
</ul>

This dataset has around 100 000 ratings so hand picking won't do!

</div>

In [118]:
import pandas as pd
import numpy as np

ratings_bots = pd.read_csv('data/ml-small/ratings_bots.csv')

<div class="exo"> **Exercise 3.2.2:** Planets discovery <br/><br/>

We will use the Planets dataset, available via the [Seaborn package](http://seaborn.pydata.org/) (see further). It provides information on how astronomers found new planets around stars, *exoplanets*.


<ul>
<li>Diplay median, mean and quantile informations for these planets orbital periods, masses, and distances.</li>
<li>For each method, display statistic on the years planets were discovered using this technique.</li>
<li>Display a table giving the number of planets discovered by each methods in each decade (1980s to 2010s)<br/>
* **hint:** the decade can be obtained as series with <tt>10 (planets['year'] // 10)</tt> and this series can be used in a groupby operation on the dataframe even though it is not a column.*</li>
</ul>

</div>

In [119]:
import pandas as pd
import numpy as np

planets = pd.read_csv('data/planets.csv')
print(planets.shape)
planets.head()

(1035, 6)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

---
<div id="style"></div>
### Package Check and Styling


<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

In [2]:
import lib.notebook_setting as nbs

packageList = ['IPython', 'numpy', 'scipy', 'matplotlib', 'cvxopt', 'pandas', 'seaborn', 'sklearn', 'tensorflow']
nbs.packageCheck(packageList)

nbs.cssStyling()

[Python version] 	2.7.12+ (default, Sep 17 2016, 12:08:02)
[GCC 6.2.0 20160914]

[Packages versions]

IPython             :	5.1.0
numpy               :	1.13.1
scipy               :	0.17.1
matplotlib          :	1.5.2rc2
cvxopt              :	1.1.9
pandas              :	0.20.3
seaborn             :	0.8.0
sklearn             :	0.17.1
tensorflow          :	1.2.1-rc1